## Plan Result (sbox-dcd_cft_sandbox-acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsight
  * azurerm_key_vault.kv
  * azurerm_resource_group.rg
  * azurerm_role_assignment.Reader
  * azurerm_role_assignment.kvaccess
  * azurerm_role_assignment.kvgroupaccess
  * azurerm_service_plan.asp
  * azurerm_storage_account.stg
  * azurerm_windows_function_app.funcapp
* Delete
  * module.acme.azurerm_application_insights.appinsight
  * module.acme.azurerm_key_vault.kv
  * module.acme.azurerm_resource_group.rg
  * module.acme.azurerm_role_assignment.Reader
  * module.acme.azurerm_role_assignment.kvaccess
  * module.acme.azurerm_role_assignment.kvgroupaccess
  * module.acme.azurerm_service_plan.asp
  * module.acme.azurerm_storage_account.stg
  * module.acme.azurerm_windows_function_app.funcapp




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsight will be created
  + resource "azurerm_application_insights" "appinsight" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "cft-platform-sbox"
      + resource_group_name                   = "cft-platform-sbox-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_deployment        = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "acmedcdcftsandbox"
      + public_network_access_enabled = true
      + resource_group_name           = "cft-platform-sbox-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "cft-platform-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # azurerm_role_assignment.Reader will be created
  + resource "azurerm_role_assignment" "Reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvaccess will be created
  + resource "azurerm_role_assignment" "kvaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvgroupaccess will be created
  + resource "azurerm_role_assignment" "kvgroupaccess" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "cft-platform-sbox-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "cft-platform-sbox-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "acmedcdcftsandbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "cft-platform-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_windows_function_app.funcapp will be created
  + resource "azurerm_windows_function_app" "funcapp" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = (known after apply)
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "acmedcdcftsandbox"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "cft-platform-sbox-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "acmedcdcftsandbox"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + auth_settings {
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = "AzureActiveDirectory"
          + enabled                        = true
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = 72
          + token_store_enabled            = false
          + unauthenticated_client_action  = "RedirectToLoginPage"

          + active_directory {
              + client_id = "67635634-c7dd-42a2-9e66-dcaf8121b8d1"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + health_check_eviction_time_in_min      = (known after apply)
          + http2_enabled                          = false
          + ip_restriction                         = (known after apply)
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_ip_restriction                     = (known after apply)
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)
        }
    }

  # module.acme.azurerm_application_insights.appinsight will be destroyed
  # (because azurerm_application_insights.appinsight is not in configuration)
  - resource "azurerm_application_insights" "appinsight" {
      - app_id                                = "486fd097-0b48-4fe2-adde-4acf184c6952" -> null
      - application_type                      = "web" -> null
      - connection_string                     = (sensitive value)
      - daily_data_cap_in_gb                  = 100 -> null
      - daily_data_cap_notifications_disabled = false -> null
      - disable_ip_masking                    = false -> null
      - force_customer_storage_for_profiler   = false -> null
      - id                                    = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Insights/components/cft-platform-sbox" -> null
      - instrumentation_key                   = (sensitive value)
      - internet_ingestion_enabled            = true -> null
      - internet_query_enabled                = true -> null
      - local_authentication_disabled         = false -> null
      - location                              = "uksouth" -> null
      - name                                  = "cft-platform-sbox" -> null
      - resource_group_name                   = "cft-platform-sbox-rg" -> null
      - retention_in_days                     = 90 -> null
      - sampling_percentage                   = 100 -> null
      - tags                                  = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - timeouts {}
    }

  # module.acme.azurerm_key_vault.kv will be destroyed
  # (because azurerm_key_vault.kv is not in configuration)
  - resource "azurerm_key_vault" "kv" {
      - access_policy                   = [] -> null
      - enable_rbac_authorization       = true -> null
      - enabled_for_deployment          = true -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      - id                              = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftsandbox" -> null
      - location                        = "uksouth" -> null
      - name                            = "acmedcdcftsandbox" -> null
      - public_network_access_enabled   = true -> null
      - purge_protection_enabled        = false -> null
      - resource_group_name             = "cft-platform-sbox-rg" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 90 -> null
      - tags                            = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null
      - tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
      - vault_uri                       = "https://acmedcdcftsandbox.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - timeouts {}
    }

  # module.acme.azurerm_resource_group.rg will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg" -> null
      - location = "uksouth" -> null
      - name     = "cft-platform-sbox-rg" -> null
      - tags     = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - timeouts {}
    }

  # module.acme.azurerm_role_assignment.Reader will be destroyed
  # (because azurerm_role_assignment.Reader is not in configuration)
  - resource "azurerm_role_assignment" "Reader" {
      - id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Authorization/roleAssignments/52dc0750-8100-fd28-4704-b217df7cfa96" -> null
      - name                 = "52dc0750-8100-fd28-4704-b217df7cfa96" -> null
      - principal_id         = "c8da72b2-bb9a-4d87-bbc8-8e38679bc5c5" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg" -> null
    }

  # module.acme.azurerm_role_assignment.kvaccess will be destroyed
  # (because azurerm_role_assignment.kvaccess is not in configuration)
  - resource "azurerm_role_assignment" "kvaccess" {
      - id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftsandbox/providers/Microsoft.Authorization/roleAssignments/bd425fd2-bec2-763a-2376-b8ce4ab32534" -> null
      - name                 = "bd425fd2-bec2-763a-2376-b8ce4ab32534" -> null
      - principal_id         = "c8da72b2-bb9a-4d87-bbc8-8e38679bc5c5" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftsandbox" -> null
    }

  # module.acme.azurerm_role_assignment.kvgroupaccess will be destroyed
  # (because azurerm_role_assignment.kvgroupaccess is not in configuration)
  - resource "azurerm_role_assignment" "kvgroupaccess" {
      - id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftsandbox/providers/Microsoft.Authorization/roleAssignments/3ed92bfa-5881-90f1-0394-9c2962cc1904" -> null
      - name                 = "3ed92bfa-5881-90f1-0394-9c2962cc1904" -> null
      - principal_id         = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftsandbox" -> null
    }

  # module.acme.azurerm_service_plan.asp will be destroyed
  # (because azurerm_service_plan.asp is not in configuration)
  - resource "azurerm_service_plan" "asp" {
      - id                           = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Web/serverfarms/cft-platform-sbox-asp" -> null
      - kind                         = "functionapp" -> null
      - location                     = "uksouth" -> null
      - maximum_elastic_worker_count = 1 -> null
      - name                         = "cft-platform-sbox-asp" -> null
      - os_type                      = "Windows" -> null
      - per_site_scaling_enabled     = false -> null
      - reserved                     = false -> null
      - resource_group_name          = "cft-platform-sbox-rg" -> null
      - sku_name                     = "Y1" -> null
      - tags                         = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null
      - worker_count                 = 0 -> null
      - zone_balancing_enabled       = false -> null
    }

  # module.acme.azurerm_storage_account.stg will be destroyed
  # (because azurerm_storage_account.stg is not in configuration)
  - resource "azurerm_storage_account" "stg" {
      - access_tier                       = "Hot" -> null
      - account_kind                      = "StorageV2" -> null
      - account_replication_type          = "ZRS" -> null
      - account_tier                      = "Standard" -> null
      - allow_nested_items_to_be_public   = false -> null
      - cross_tenant_replication_enabled  = true -> null
      - default_to_oauth_authentication   = false -> null
      - enable_https_traffic_only         = true -> null
      - id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Storage/storageAccounts/acmedcdcftsandbox" -> null
      - infrastructure_encryption_enabled = false -> null
      - is_hns_enabled                    = false -> null
      - location                          = "uksouth" -> null
      - min_tls_version                   = "TLS1_2" -> null
      - name                              = "acmedcdcftsandbox" -> null
      - nfsv3_enabled                     = false -> null
      - primary_access_key                = (sensitive value)
      - primary_blob_connection_string    = (sensitive value)
      - primary_blob_endpoint             = "https://acmedcdcftsandbox.blob.core.windows.net/" -> null
      - primary_blob_host                 = "acmedcdcftsandbox.blob.core.windows.net" -> null
      - primary_connection_string         = (sensitive value)
      - primary_dfs_endpoint              = "https://acmedcdcftsandbox.dfs.core.windows.net/" -> null
      - primary_dfs_host                  = "acmedcdcftsandbox.dfs.core.windows.net" -> null
      - primary_file_endpoint             = "https://acmedcdcftsandbox.file.core.windows.net/" -> null
      - primary_file_host                 = "acmedcdcftsandbox.file.core.windows.net" -> null
      - primary_location                  = "uksouth" -> null
      - primary_queue_endpoint            = "https://acmedcdcftsandbox.queue.core.windows.net/" -> null
      - primary_queue_host                = "acmedcdcftsandbox.queue.core.windows.net" -> null
      - primary_table_endpoint            = "https://acmedcdcftsandbox.table.core.windows.net/" -> null
      - primary_table_host                = "acmedcdcftsandbox.table.core.windows.net" -> null
      - primary_web_endpoint              = "https://acmedcdcftsandbox.z33.web.core.windows.net/" -> null
      - primary_web_host                  = "acmedcdcftsandbox.z33.web.core.windows.net" -> null
      - public_network_access_enabled     = true -> null
      - queue_encryption_key_type         = "Service" -> null
      - resource_group_name               = "cft-platform-sbox-rg" -> null
      - secondary_access_key              = (sensitive value)
      - secondary_connection_string       = (sensitive value)
      - shared_access_key_enabled         = true -> null
      - table_encryption_key_type         = "Service" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {

          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }

          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }

          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {

          - retention_policy {
              - days = 7 -> null
            }
        }

      - timeouts {}
    }

  # module.acme.azurerm_windows_function_app.funcapp will be destroyed
  # (because azurerm_windows_function_app.funcapp is not in configuration)
  - resource "azurerm_windows_function_app" "funcapp" {
      - app_settings                      = {
          - "Acmebot:AzureDns:SubscriptionId"            = "bf308a5c-0624-4334-8ff8-8dca9fd43783"
          - "Acmebot:Contacts"                           = "cnp-acme-owner@hmcts.net"
          - "Acmebot:Endpoint"                           = "https://acme-v02.api.letsencrypt.org/"
          - "Acmebot:Environment"                        = "AzureCloud"
          - "Acmebot:VaultBaseUrl"                       = "https://acmedcdcftsandbox.vault.azure.net/"
          - "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          - "FUNCTIONS_WORKER_RUNTIME"                   = "dotnet"
          - "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"   = (sensitive)
          - "WEBSITE_CONTENTSHARE"                       = "cft-platform-sbox"
          - "WEBSITE_RUN_FROM_PACKAGE"                   = "https://stacmebotprod.blob.core.windows.net/keyvault-acmebot/v4/latest.zip"
        } -> null
      - builtin_logging_enabled           = true -> null
      - client_certificate_enabled        = false -> null
      - client_certificate_mode           = "Optional" -> null
      - content_share_force_disabled      = false -> null
      - custom_domain_verification_id     = (sensitive value)
      - daily_memory_time_quota           = 0 -> null
      - default_hostname                  = "acmedcdcftsandbox.azurewebsites.net" -> null
      - enabled                           = true -> null
      - functions_extension_version       = "~4" -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Web/sites/acmedcdcftsandbox" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - kind                              = "functionapp" -> null
      - location                          = "uksouth" -> null
      - name                              = "acmedcdcftsandbox" -> null
      - outbound_ip_address_list          = [
          - "20.90.67.150",
          - "20.90.67.187",
          - "20.90.68.5",
          - "20.90.68.16",
          - "20.90.68.27",
          - "20.90.68.44",
          - "51.104.28.82",
        ] -> null
      - outbound_ip_addresses             = "20.90.67.150,20.90.67.187,20.90.68.5,20.90.68.16,20.90.68.27,20.90.68.44,51.104.28.82" -> null
      - possible_outbound_ip_address_list = [
          - "20.90.67.150",
          - "20.90.67.187",
          - "20.90.68.5",
          - "20.90.68.16",
          - "20.90.68.27",
          - "20.90.68.44",
          - "20.90.68.47",
          - "20.90.68.89",
          - "20.90.68.124",
          - "20.90.68.170",
          - "20.90.68.191",
          - "20.90.68.236",
          - "20.90.69.2",
          - "20.90.69.11",
          - "20.90.69.17",
          - "20.90.64.230",
          - "20.90.69.26",
          - "20.90.69.73",
          - "20.90.69.92",
          - "20.90.66.230",
          - "20.90.68.189",
          - "20.90.69.124",
          - "20.90.69.126",
          - "20.90.69.129",
          - "20.90.69.133",
          - "20.90.69.6",
          - "20.90.69.163",
          - "20.90.69.192",
          - "20.90.69.207",
          - "20.90.69.239",
          - "51.104.28.82",
        ] -> null
      - possible_outbound_ip_addresses    = "20.90.67.150,20.90.67.187,20.90.68.5,20.90.68.16,20.90.68.27,20.90.68.44,20.90.68.47,20.90.68.89,20.90.68.124,20.90.68.170,20.90.68.191,20.90.68.236,20.90.69.2,20.90.69.11,20.90.69.17,20.90.64.230,20.90.69.26,20.90.69.73,20.90.69.92,20.90.66.230,20.90.68.189,20.90.69.124,20.90.69.126,20.90.69.129,20.90.69.133,20.90.69.6,20.90.69.163,20.90.69.192,20.90.69.207,20.90.69.239,51.104.28.82" -> null
      - resource_group_name               = "cft-platform-sbox-rg" -> null
      - service_plan_id                   = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.Web/serverfarms/cft-platform-sbox-asp" -> null
      - site_credential                   = [
          - {
              - name     = "$acmedcdcftsandbox"
              - password = "rtQsFlDY0FGhjxqF5AXpjtRf5C3bkuidK1i2AnLJcp7sXpNbgfr739i7G8ou"
            },
        ] -> null
      - storage_account_access_key        = (sensitive value)
      - storage_account_name              = "acmedcdcftsandbox" -> null
      - storage_key_vault_secret_id       = "" -> null
      - storage_uses_managed_identity     = false -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-enterprise-acme"
          - "businessArea" = "CFT"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> null
      - virtual_network_subnet_id         = "" -> null

      - auth_settings {
          - additional_login_parameters    = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - default_provider               = "AzureActiveDirectory" -> null
          - enabled                        = true -> null
          - token_refresh_extension_hours  = 72 -> null
          - token_store_enabled            = false -> null
          - unauthenticated_client_action  = "RedirectToLoginPage" -> null

          - active_directory {
              - allowed_audiences = [] -> null
              - client_id         = "67635634-c7dd-42a2-9e66-dcaf8121b8d1" -> null
            }
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "c8da72b2-bb9a-4d87-bbc8-8e38679bc5c5" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                              = false -> null
          - api_definition_url                     = "" -> null
          - api_management_api_id                  = "" -> null
          - app_command_line                       = "" -> null
          - app_scale_limit                        = 200 -> null
          - application_insights_connection_string = (sensitive value)
          - application_insights_key               = (sensitive value)
          - default_documents                      = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled         = false -> null
          - elastic_instance_minimum               = 0 -> null
          - ftps_state                             = "Disabled" -> null
          - health_check_eviction_time_in_min      = 0 -> null
          - health_check_path                      = "" -> null
          - http2_enabled                          = false -> null
          - ip_restriction                         = [] -> null
          - load_balancing_mode                    = "LeastRequests" -> null
          - managed_pipeline_mode                  = "Integrated" -> null
          - minimum_tls_version                    = "1.2" -> null
          - pre_warmed_instance_count              = 0 -> null
          - remote_debugging_enabled               = false -> null
          - remote_debugging_version               = "" -> null
          - runtime_scale_monitoring_enabled       = false -> null
          - scm_ip_restriction                     = [] -> null
          - scm_minimum_tls_version                = "1.2" -> null
          - scm_type                               = "None" -> null
          - scm_use_main_ip_restriction            = false -> null
          - use_32_bit_worker                      = true -> null
          - vnet_route_all_enabled                 = false -> null
          - websockets_enabled                     = false -> null
          - windows_fx_version                     = "" -> null
          - worker_count                           = 1 -> null
        }
    }

Plan: 9 to add, 0 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sbox-dcd_cft_sandbox-acme","Vars":{}} -->